## Import the Library

In [2]:
import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt

## Load the Data File|

In [3]:
DataSet=pd.read_csv("sample_ipl_data.csv")
print(DataSet)

   match_id team1 team2 winner      venue  runs_team1  runs_team2
0         1    MI   CSK     MI     Mumbai         165         160
1         2   CSK   RCB    RCB    Chennai         150         151
2         3   RCB    GT     GT  Bangalore         178         180
3         4    MI    RR     RR      Delhi         190         192
4         5    GT   LSG     GT  Ahmedabad         200         198

In [4]:
DataSet.head()

   match_id team1 team2 winner      venue  runs_team1  runs_team2
0         1    MI   CSK     MI     Mumbai         165         160
1         2   CSK   RCB    RCB    Chennai         150         151
2         3   RCB    GT     GT  Bangalore         178         180
3         4    MI    RR     RR      Delhi         190         192
4         5    GT   LSG     GT  Ahmedabad         200         198

In [5]:
DataSet.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   match_id    5 non-null      int64
 1   team1       5 non-null      object
 2   team2       5 non-null      object
 3   winner      5 non-null      object
 4   venue       5 non-null      object
 5   runs_team1  5 non-null      int64
 6   runs_team2  5 non-null      int64
dtypes: int64(3), object(4)
memory usage: 412.0+ bytes

In [6]:
DataSet.size

35

In [7]:
DataSet.shape

(5, 7)

In [8]:
DataSet.isna()

   match_id  team1  team2  winner  venue  runs_team1  runs_team2
0     False  False  False   False  False       False       False
1     False  False  False   False  False       False       False
2     False  False  False   False  False       False       False
3     False  False  False   False  False       False       False
4     False  False  False   False  False       False       False

In [9]:
DataSet.describe()

       match_id  runs_team1  runs_team2
count  5.000000    5.000000    5.000000
mean   3.000000  176.600000  176.200000
std    1.581139   19.819183   20.228692
min    1.000000  150.000000  151.000000
25%    2.000000  165.000000  160.000000
50%    3.000000  178.000000  180.000000
75%    4.000000  190.000000  192.000000
max    5.000000  200.000000  198.000000

In [10]:
DataSet.columns

Index(['match_id', 'team1', 'team2', 'winner', 'venue', 'runs_team1',
       'runs_team2'],
      dtype='object')

In [11]:
DataSet.head()

   match_id team1 team2 winner      venue  runs_team1  runs_team2
0         1    MI   CSK     MI     Mumbai         165         160
1         2   CSK   RCB    RCB    Chennai         150         151
2         3   RCB    GT     GT  Bangalore         178         180
3         4    MI    RR     RR      Delhi         190         192
4         5    GT   LSG     GT  Ahmedabad         200         198

In [12]:
DataSet["Total Score"]=DataSet.runs_team1+ DataSet.runs_team2

In [13]:
DataSet[DataSet["Total Score"]>320]

   match_id team1 team2 winner      venue  runs_team1  runs_team2  Total Score
0         1    MI   CSK     MI     Mumbai         165         160          325
2         3   RCB    GT     GT  Bangalore         178         180          358
3         4    MI    RR     RR      Delhi         190         192          382
4         5    GT   LSG     GT  Ahmedabad         200         198          398

In [14]:
DataSet[DataSet["team1"]=="MI"]

   match_id team1 team2 winner   venue  runs_team1  runs_team2  Total Score
0         1    MI   CSK     MI  Mumbai         165         160          325
3         4    MI    RR     RR   Delhi         190         192          382

In [15]:
unique=DataSet["team1"].unique()
print(unique)

['MI' 'CSK' 'RCB' 'GT']

In [16]:
DataSet

   match_id team1 team2 winner      venue  runs_team1  runs_team2  Total Score
0         1    MI   CSK     MI     Mumbai         165         160          325
1         2   CSK   RCB    RCB    Chennai         150         151          301
2         3   RCB    GT     GT  Bangalore         178         180          358
3         4    MI    RR     RR      Delhi         190         192          382
4         5    GT   LSG     GT  Ahmedabad         200         198          398

In [17]:
winners=DataSet["winner"]
totalScore=DataSet["Total Score"]

print(winners, totalScore)

0     MI
1    RCB
2     GT
3     RR
4     GT
Name: winner, dtype: object 0    325
1    301
2    358
3    382
4    398
Name: Total Score, dtype: int64

In [18]:
DataSetNumpy=np.array(DataSet)

In [19]:
print(DataSetNumpy)

[[1 'MI' 'CSK' 'MI' 'Mumbai' 165 160 325]
 [2 'CSK' 'RCB' 'RCB' 'Chennai' 150 151 301]
 [3 'RCB' 'GT' 'GT' 'Bangalore' 178 180 358]
 [4 'MI' 'RR' 'RR' 'Delhi' 190 192 382]
 [5 'GT' 'LSG' 'GT' 'Ahmedabad' 200 198 398]]

In [20]:
DataSet

   match_id team1 team2 winner      venue  runs_team1  runs_team2  Total Score
0         1    MI   CSK     MI     Mumbai         165         160          325
1         2   CSK   RCB    RCB    Chennai         150         151          301
2         3   RCB    GT     GT  Bangalore         178         180          358
3         4    MI    RR     RR      Delhi         190         192          382
4         5    GT   LSG     GT  Ahmedabad         200         198          398

In [21]:
DataSet.loc[0:2]

   match_id team1 team2 winner      venue  runs_team1  runs_team2  Total Score
0         1    MI   CSK     MI     Mumbai         165         160          325
1         2   CSK   RCB    RCB    Chennai         150         151          301
2         3   RCB    GT     GT  Bangalore         178         180          358